saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC1300_DFP.1.1.0.pdsc
        <!-- *************************  Device 'LPC1313FBD48'  ***************************** -->
        <device Dname="LPC1313FBD48">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13xx/LPC13xx.h"/>
          <debug svd="SVD/LPC13xx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_32.FLM" start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1311_13_42_43_UM.pdf" title="LPC1311/13/42/43 Reference Manual"/>
          <book name="Documents/LPC1311_13_42_43_DS.pdf" title="LPC1311/13/42/43 Datasheet"/>
          <book name="Documents/LPC1311_13_ES.pdf"       title="LPC1311/13 Erratasheet"/>

          <feature type="SPI"           n="1"       m="25000000"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="IOs"           n="48"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'LPC1313FBD48/01'  ***************************** -->
        <device Dname="LPC1313FBD48/01">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13xx/LPC13xx.h"/>
          <debug svd="SVD/LPC13xx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_32.FLM" start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1311_13_42_43_UM.pdf" title="LPC1311/13/42/43 Reference Manual"/>
          <book name="Documents/LPC1311_13_42_43_DS.pdf" title="LPC1311/13/42/43 Datasheet"/>
          <book name="Documents/LPC1311_13_ES.pdf"       title="LPC1311/13 Erratasheet"/>

          <feature type="PowerOther"    n="1"                           name="Power profiles"/>
          <feature type="SPI"           n="1"       m="25000000"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="IOs"           n="48"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'LPC1315FHN33'  ***************************** -->
        <device Dname="LPC1315FHN33">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13Uxx/LPC13Uxx.h"/>
          <debug svd="SVD/LPC13Uxx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_32.FLM" start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1315_16_17_45_46_47_UM.pdf" title="LPC1315/16/17/45/46/47 Reference Manual"/>
          <book name="Documents/LPC1315_16_17_45_46_47_DS.pdf" title="LPC1315/16/17/45/46/47 Datasheet"/>
          <book name="Documents/ES_LPC131X_4X.pdf"             title="LPC1315/16/17/45/46/47 Erratasheet"/>

          <feature type="MemoryOther"   n="1"                           name="2kB EEPROM"/>
          <feature type="SPI"           n="2"       m="25000000"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1315FBD48'  ***************************** -->
        <device Dname="LPC1315FBD48">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13Uxx/LPC13Uxx.h"/>
          <debug svd="SVD/LPC13Uxx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_32.FLM" start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1315_16_17_45_46_47_UM.pdf" title="LPC1315/16/17/45/46/47 Reference Manual"/>
          <book name="Documents/LPC1315_16_17_45_46_47_DS.pdf" title="LPC1315/16/17/45/46/47 Datasheet"/>
          <book name="Documents/ES_LPC131X_4X.pdf"             title="LPC1315/16/17/45/46/47 Erratasheet"/>

          <feature type="MemoryOther"   n="1"                           name="2kB EEPROM"/>
          <feature type="SPI"           n="2"       m="25000000"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'LPC1316FHN33'  ***************************** -->
        <device Dname="LPC1316FHN33">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13Uxx/LPC13Uxx.h"/>
          <debug svd="SVD/LPC13Uxx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0xC000"     startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_48.FLM" start="0x00000000"  size="0xC000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1315_16_17_45_46_47_UM.pdf" title="LPC1315/16/17/45/46/47 Reference Manual"/>
          <book name="Documents/LPC1315_16_17_45_46_47_DS.pdf" title="LPC1315/16/17/45/46/47 Datasheet"/>
          <book name="Documents/ES_LPC131X_4X.pdf"             title="LPC1315/16/17/45/46/47 Erratasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="SPI"           n="2"       m="25000000"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1316FBD48'  ***************************** -->
        <device Dname="LPC1316FBD48">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13Uxx/LPC13Uxx.h"/>
          <debug svd="SVD/LPC13Uxx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0xC000"     startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_48.FLM" start="0x00000000"  size="0xC000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1315_16_17_45_46_47_UM.pdf" title="LPC1315/16/17/45/46/47 Reference Manual"/>
          <book name="Documents/LPC1315_16_17_45_46_47_DS.pdf" title="LPC1315/16/17/45/46/47 Datasheet"/>
          <book name="Documents/ES_LPC131X_4X.pdf"             title="LPC1315/16/17/45/46/47 Erratasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="SPI"           n="2"       m="25000000"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
        </device>

