saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC1300_DFP.1.1.0.pdsc
        <!-- *************************  Device 'LPC1345FBD48'  ***************************** -->
        <device Dname="LPC1345FBD48">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13Uxx/LPC13Uxx.h"/>
          <debug svd="SVD/LPC13Uxx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_32.FLM" start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1315_16_17_45_46_47_UM.pdf" title="LPC1315/16/17/45/46/47 Reference Manual"/>
          <book name="Documents/LPC1315_16_17_45_46_47_DS.pdf" title="LPC1315/16/17/45/46/47 Datasheet"/>
          <book name="Documents/ES_LPC131X_4X.pdf"             title="LPC1315/16/17/45/46/47 Erratasheet"/>

          <feature type="MemoryOther"   n="1"                           name="2kB EEPROM"/>
          <feature type="SPI"           n="2"       m="25000000"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'LPC1346FHN33'  ***************************** -->
        <device Dname="LPC1346FHN33">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13Uxx/LPC13Uxx.h"/>
          <debug svd="SVD/LPC13Uxx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0xC000"     startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_48.FLM" start="0x00000000"  size="0xC000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1315_16_17_45_46_47_UM.pdf" title="LPC1315/16/17/45/46/47 Reference Manual"/>
          <book name="Documents/LPC1315_16_17_45_46_47_DS.pdf" title="LPC1315/16/17/45/46/47 Datasheet"/>
          <book name="Documents/ES_LPC131X_4X.pdf"             title="LPC1315/16/17/45/46/47 Erratasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="SPI"           n="2"       m="25000000"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="IOs"           n="26"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1346FBD48'  ***************************** -->
        <device Dname="LPC1346FBD48">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13Uxx/LPC13Uxx.h"/>
          <debug svd="SVD/LPC13Uxx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0xC000"     startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_48.FLM" start="0x00000000"  size="0xC000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1315_16_17_45_46_47_UM.pdf" title="LPC1315/16/17/45/46/47 Reference Manual"/>
          <book name="Documents/LPC1315_16_17_45_46_47_DS.pdf" title="LPC1315/16/17/45/46/47 Datasheet"/>
          <book name="Documents/ES_LPC131X_4X.pdf"             title="LPC1315/16/17/45/46/47 Erratasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="SPI"           n="2"       m="25000000"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'LPC1347FHN33'  ***************************** -->
        <device Dname="LPC1347FHN33">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13Uxx/LPC13Uxx.h"/>
          <debug svd="SVD/LPC13Uxx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                     start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_64.FLM" start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1315_16_17_45_46_47_UM.pdf" title="LPC1315/16/17/45/46/47 Reference Manual"/>
          <book name="Documents/LPC1315_16_17_45_46_47_DS.pdf" title="LPC1315/16/17/45/46/47 Datasheet"/>
          <book name="Documents/ES_LPC131X_4X.pdf"             title="LPC1315/16/17/45/46/47 Erratasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="SPI"           n="2"       m="25000000"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="IOs"           n="26"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1347FBD48'  ***************************** -->
        <device Dname="LPC1347FBD48">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13Uxx/LPC13Uxx.h"/>
          <debug svd="SVD/LPC13Uxx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                     start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_64.FLM" start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1315_16_17_45_46_47_UM.pdf" title="LPC1315/16/17/45/46/47 Reference Manual"/>
          <book name="Documents/LPC1315_16_17_45_46_47_DS.pdf" title="LPC1315/16/17/45/46/47 Datasheet"/>
          <book name="Documents/ES_LPC131X_4X.pdf"             title="LPC1315/16/17/45/46/47 Erratasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="SPI"           n="2"       m="25000000"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'LPC1347FBD64'  ***************************** -->
        <device Dname="LPC1347FBD64">
          <processor Dclock="72000000"/>
          <compile header="Device/Include/LPC13Uxx/LPC13Uxx.h"/>
          <debug svd="SVD/LPC13Uxx.svd"/>
          <memory id="IROM1"                     start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory id="IRAM1"                     start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                     start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC1xxx_64.FLM" start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <book name="Documents/LPC1315_16_17_45_46_47_UM.pdf" title="LPC1315/16/17/45/46/47 Reference Manual"/>
          <book name="Documents/LPC1315_16_17_45_46_47_DS.pdf" title="LPC1315/16/17/45/46/47 Datasheet"/>
          <book name="Documents/ES_LPC131X_4X.pdf"             title="LPC1315/16/17/45/46/47 Erratasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="SPI"           n="2"       m="25000000"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="LPC13Uxx">
      <description>NXP LPC1300 Series devices</description>
      <require Dvendor="NXP:11"/>
      <accept Dname="LPC1345*"/>
      <accept Dname="LPC1346*"/>
      <accept Dname="LPC1347*"/>
      <accept Dname="LPC1315*"/>
      <accept Dname="LPC1316*"/>
      <accept Dname="LPC1317*"/>
    </condition>

    <condition id="LPC13xx">
      <description>NXP LPC1300 Series devices</description>
      <require Dvendor="NXP:11"/>
      <accept Dname="LPC1311*"/>
      <accept Dname="LPC1313*"/>
      <accept Dname="LPC1342*"/>
      <accept Dname="LPC1343*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="LPC13Uxx CMSIS">
      <description>NXP LPC1300 Series devices and CMSIS-CORE</description>
      <require condition="LPC13Uxx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC13xx CMSIS">
      <description>NXP LPC1300 Series devices and CMSIS-CORE</description>
      <require condition="LPC13xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

