saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC1300_DFP.1.1.0.pdsc
  </conditions>

  <components>
    <!-- Startup LPC13Uxx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC13Uxx CMSIS">
      <description>System Startup for NXP LPC13Uxx Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/LPC13Uxx/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC13Uxx.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC13Uxx.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC13xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC13xx CMSIS">
      <description>System Startup for NXP LPC13xx Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/LPC13xx/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC13xx.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC13xx.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

  </components>

  <boards>
    <board vendor="Keil" name="MCB1313" revision="Ver 2.0" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB1000=ON">
      <description>Keil MCB1000 Board Support and Examples</description>
      <image small="Boards/Keil/MCB1313/Documents/mcb1000.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcb1000/" title="MCB1000 Web Page"/>
      <book category="schematic" name="Boards/Keil/MCB1313/Documents/mcb1000-schematics.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1313FBD48"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC1313"/>
      <feature type="USB"       n="1"              name="Full-Speed USB device with USB Standard-B Connector"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="RS232"     n="1"              name="DB9 Female Connector"/>
      <feature type="CAN"       n="1"              name="DB9 Male Connector"/>
      <feature type="Poti"      n="1"/>
      <feature type="LED"       n="9"              name="LEDs: eight user, one PWR LED"/>
      <feature type="Button"    n="4"              name="Push-buttons: 2 GPIO, ISP and Reset"/>
      <feature type="ConnOther" n="1"              name="10pin Cortex Debug Interface"/>
      <feature type="XTAL"      n="12000000"/>
      <feature type="CustomFF"  n="80" m="80"/>
    </board>

    <board vendor="Keil" name="MCB1343" revision="Ver 2.0" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB1000=ON">
      <description>Keil MCB1000 Board Support and Examples</description>
      <image small="Boards/Keil/MCB1313/Documents/mcb1000.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcb1000/" title="MCB1000 Web Page"/>
      <book category="schematic" name="Boards/Keil/MCB1313/Documents/mcb1000-schematics.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1343FBD48"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC1343"/>
      <feature type="USB"       n="1"              name="Full-Speed USB device with USB Standard-B Connector"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="RS232"     n="1"              name="DB9 Female Connector"/>
      <feature type="CAN"       n="1"              name="DB9 Male Connector"/>
      <feature type="Poti"      n="1"/>
      <feature type="LED"       n="9"              name="LEDs: eight user, one PWR LED"/>
      <feature type="Button"    n="4"              name="Push-buttons: 2 GPIO, ISP and Reset"/>
      <feature type="ConnOther" n="1"              name="10pin Cortex Debug Interface"/>
      <feature type="XTAL"      n="12000000"/>
      <feature type="CustomFF"  n="80" m="80"/>
    </board>

  </boards>


  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Keil/MCB1313/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCB1313" vendor="Keil" Dvendor="NXP:11" Dname="LPC1313FBD48"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Keil/MCB1343/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCB1343" vendor="Keil" Dvendor="NXP:11" Dname="LPC1343FBD48"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>


</package>
